[{"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "The MarCO Mission Comes to an End", "preview": "The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."}, {"title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "preview": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "Three New Views of Mars' Moon Phobos", "preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."}, {"title": "NASA's New Mars Rover Is Ready for Space Lasers", "preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}, {"title": "A New Video Captures the Science of NASA's Perseverance Mars Rover", "preview": "With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."}, {"title": "Mars Helicopter Attached to NASA's Perseverance Rover", "preview": "The team also fueled the rover's sky crane to get ready for this summer's history-making launch."}, {"title": "NASA's Mars 2020 Comes Full Circle", "preview": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL. "}, {"title": "3 Things We've Learned From NASA's Mars InSight ", "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}, {"title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."}, {"title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}, {"title": "Meet the People Behind NASA's Perseverance Rover", "preview": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "}]